###############################################################################
# Created by write_sdc
###############################################################################
current_design classifier_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {class_id[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {class_id[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {class_id[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_class}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {new_feat}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {w_int8[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {w_int8[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {w_int8[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {w_int8[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {w_int8[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {w_int8[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {w_int8[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {w_int8[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_int4[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_int4[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_int4[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_int4[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {acc20[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_class[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_class[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_class[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {max_score[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0060 [get_ports {acc20[19]}]
set_load -pin_load 0.0060 [get_ports {acc20[18]}]
set_load -pin_load 0.0060 [get_ports {acc20[17]}]
set_load -pin_load 0.0060 [get_ports {acc20[16]}]
set_load -pin_load 0.0060 [get_ports {acc20[15]}]
set_load -pin_load 0.0060 [get_ports {acc20[14]}]
set_load -pin_load 0.0060 [get_ports {acc20[13]}]
set_load -pin_load 0.0060 [get_ports {acc20[12]}]
set_load -pin_load 0.0060 [get_ports {acc20[11]}]
set_load -pin_load 0.0060 [get_ports {acc20[10]}]
set_load -pin_load 0.0060 [get_ports {acc20[9]}]
set_load -pin_load 0.0060 [get_ports {acc20[8]}]
set_load -pin_load 0.0060 [get_ports {acc20[7]}]
set_load -pin_load 0.0060 [get_ports {acc20[6]}]
set_load -pin_load 0.0060 [get_ports {acc20[5]}]
set_load -pin_load 0.0060 [get_ports {acc20[4]}]
set_load -pin_load 0.0060 [get_ports {acc20[3]}]
set_load -pin_load 0.0060 [get_ports {acc20[2]}]
set_load -pin_load 0.0060 [get_ports {acc20[1]}]
set_load -pin_load 0.0060 [get_ports {acc20[0]}]
set_load -pin_load 0.0060 [get_ports {max_class[2]}]
set_load -pin_load 0.0060 [get_ports {max_class[1]}]
set_load -pin_load 0.0060 [get_ports {max_class[0]}]
set_load -pin_load 0.0060 [get_ports {max_score[19]}]
set_load -pin_load 0.0060 [get_ports {max_score[18]}]
set_load -pin_load 0.0060 [get_ports {max_score[17]}]
set_load -pin_load 0.0060 [get_ports {max_score[16]}]
set_load -pin_load 0.0060 [get_ports {max_score[15]}]
set_load -pin_load 0.0060 [get_ports {max_score[14]}]
set_load -pin_load 0.0060 [get_ports {max_score[13]}]
set_load -pin_load 0.0060 [get_ports {max_score[12]}]
set_load -pin_load 0.0060 [get_ports {max_score[11]}]
set_load -pin_load 0.0060 [get_ports {max_score[10]}]
set_load -pin_load 0.0060 [get_ports {max_score[9]}]
set_load -pin_load 0.0060 [get_ports {max_score[8]}]
set_load -pin_load 0.0060 [get_ports {max_score[7]}]
set_load -pin_load 0.0060 [get_ports {max_score[6]}]
set_load -pin_load 0.0060 [get_ports {max_score[5]}]
set_load -pin_load 0.0060 [get_ports {max_score[4]}]
set_load -pin_load 0.0060 [get_ports {max_score[3]}]
set_load -pin_load 0.0060 [get_ports {max_score[2]}]
set_load -pin_load 0.0060 [get_ports {max_score[1]}]
set_load -pin_load 0.0060 [get_ports {max_score[0]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_class}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {new_feat}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {class_id[2]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {class_id[1]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {class_id[0]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {w_int8[7]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {w_int8[6]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {w_int8[5]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {w_int8[4]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {w_int8[3]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {w_int8[2]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {w_int8[1]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {w_int8[0]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_int4[3]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_int4[2]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_int4[1]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_int4[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
